In [37]:
import pandas as pd
import numpy as np

In [38]:
days = pd.Series(["Monday", "Tuesday", "Wednesday"])
days

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [39]:
days_list = np.array(["Monday", "Tuesday", "Wednesday"])
numpy_days = pd.Series(days_list)
print(numpy_days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [63]:
days_list

array(['Monday', 'Tuesday', 'Wednesday'], dtype='<U9')

In [40]:
days = pd.Series(["Monday", "Tuesday", "Wednesday"], 
                 index = ["a", "b", "c"])
days

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [41]:
days1 = pd.Series({"a": "Monday", "b":"Tuesday", "c": "Wednesday"})
days1

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [42]:
days[0]

'Monday'

In [43]:
days[1:]

b      Tuesday
c    Wednesday
dtype: object

In [44]:
days['b']

'Tuesday'

In [45]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [46]:
df_dict = {"Country": ["Ghana", "Kenya", "Nigeria", "Togo"],
            "Capital": ["Accra", "Nairobi", "Abuja", "Lome"],
            "Population": [10000, 8500, 35000, 12000],
            "Age": [60, 70, 80, 75]
}
df = pd.DataFrame(df_dict, index = [2, 4, 6, 8])
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [64]:
df_dict

{'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
 'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
 'Population': [10000, 8500, 35000, 12000],
 'Age': [60, 70, 80, 75]}

In [47]:
df_list = [["Ghana", "Accra", 10000, 60],
           ["Kenya", "Nairobi", 8500, 70],
           ["Nigeria", "Abuja", 35000, 80],
           ["Togo", "Lome", 12000, 75]]
df1 = pd.DataFrame(df_list, columns =["Country", "Capital", "Population", "Age"],
                  index = [2, 4, 6, 8])
df1

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

at, iat, iloc and loc are accessors used to retrieve data in dataframes. iloc selects values from the rows and columns by using integer index to locate positions while loc selects row or columns using labels. at and iat are used to retrieve single values such that at uses the column and row labels and iat uses indices.

In [48]:
df.iloc[3]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

In [49]:
df.loc[4]

Country         Kenya
Capital       Nairobi
Population       8500
Age                70
Name: 4, dtype: object

In [50]:
df["Capital"]

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [51]:
df.at[6, "Country"]

'Nigeria'

In [52]:
df.iat[2, 1]

'Abuja'

The important Pandas functionalities: indexing, reindexing, selection, group, drop entities, ranking, sorting, duplicates and indexing by hierarchy.

Summary and descriptive statistics: measure of central tendency, measure of dispersion, skewness and kurtosis, correlation and multicollinearity

Similar to Numpy, Pandas has some functions that provide descriptive statistics such as the measures of central tendency, dispersion, skewness and kurtosis, correlation and multicollinearity. Some functions are mode(), median(), mean(), sum(), std(), var(), skew(), kurt() and min(). The describe function gives the summary  of the numeric columns in a dataframe displaying count, mean, standard deviation, interquartile range, minimum and maximum values.

In [53]:
df["Population"].sum()

65500

In [54]:
df["Age"].mean()

71.25

In [55]:
df.sum()

Country       GhanaKenyaNigeriaTogo
Capital       AccraNairobiAbujaLome
Population                    65500
Age                             285
dtype: object

In [56]:
df.mean()

Population    16375.00
Age              71.25
dtype: float64

In [57]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

The missing data enigma: Importance, types and handling missing data.
Often data used for analysis in real life scenarios is incomplete as a result of omission, faulty devices and many other factors. Pandas represent missing values as NA or NaN which can be filled, removed and detected with functions like fillna(), dropna(), isnull(), notnull(), replace().

In [58]:
df_dict2 = {"Name": ["Jafar", "Anas", "Mukthar", np.nan], 
           "Profession": ["Farm Manager", "Editor", "Geophysiscist", "Economist"],
           "Experiance": [1, np.nan, 2, 7],
           "Height": [np.nan, 175, 180, 150]}
new_df = pd.DataFrame(df_dict2)
new_df

      Name     Profession  Experiance  Height
0    Jafar   Farm Manager         1.0     NaN
1     Anas         Editor         NaN   175.0
2  Mukthar  Geophysiscist         2.0   180.0
3      NaN      Economist         7.0   150.0

In [59]:
new_df.isnull()

    Name  Profession  Experiance  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [60]:
new_df.dropna()

      Name     Profession  Experiance  Height
2  Mukthar  Geophysiscist         2.0   180.0

In [61]:
new_df.fillna(0)

      Name     Profession  Experiance  Height
0    Jafar   Farm Manager         1.0     0.0
1     Anas         Editor         0.0   175.0
2  Mukthar  Geophysiscist         2.0   180.0
3        0      Economist         7.0   150.0

In [65]:
new_df[["Name"]] = new_df[["Name"]].fillna(value = "Aisha")

In [66]:
new_df

      Name     Profession  Experiance  Height
0    Jafar   Farm Manager         1.0     NaN
1     Anas         Editor         NaN   175.0
2  Mukthar  Geophysiscist         2.0   180.0
3    Aisha      Economist         7.0   150.0

In [67]:
new_df[["Experiance"]] = new_df[["Experiance"]].fillna(value = 1.5)
new_df

      Name     Profession  Experiance  Height
0    Jafar   Farm Manager         1.0     NaN
1     Anas         Editor         1.5   175.0
2  Mukthar  Geophysiscist         2.0   180.0
3    Aisha      Economist         7.0   150.0

In [68]:
new_df[["Height"]] = new_df[["Height"]].fillna(value = 150)
new_df

      Name     Profession  Experiance  Height
0    Jafar   Farm Manager         1.0   150.0
1     Anas         Editor         1.5   175.0
2  Mukthar  Geophysiscist         2.0   180.0
3    Aisha      Economist         7.0   150.0